#pragma once

#include "pch.h"
#include "MagicGridCell.h"
#include "utilites.h"

using namespace std;
using namespace concurrency;


////////////////////////////////////////////////////////////
/// \brief Колонка сетки.
///
/// Хранит в себе ячейки сетки столкновений.
///
////////////////////////////////////////////////////////////
class MagicGridColumn
{


private:

	////////////////////////////////////////////////////////////
	/// \brief Вектор уникальных указателей на ячейки.
	///
	////////////////////////////////////////////////////////////
	vector<unique_ptr<MagicGridCell>> cells;

public:
	////////////////////////////////////////////////////////////
	/// \brief Создает колонку определенной высоты.
	///
	/// Создает колонку и заполняет ее ячейками.
	///  
	/// \param height     Количество ячеек в колонке.
	///
	////////////////////////////////////////////////////////////
	MagicGridColumn(const size_t height);

	////////////////////////////////////////////////////////////
	/// \brief Получает сет неподвижных объектов.
	///
	/// Неподвижные объекты хранятся в отдельном сете,
	/// чтобы не задумываться об обновлении их положения.
	/// 
	/// \param y     y-координата ячейки
	///
	////////////////////////////////////////////////////////////
	utilites::MagicGameObjectsConcurrensUnorderedSet* const GetCellStaticObjectsSet(const size_t y) const;

	////////////////////////////////////////////////////////////
	/// \brief Получает сет подвижных объектов.
	///
	/// Подвижные объекты хранятся в отдельном сете,
	/// чтобы в каждом кадре обновлять ячейку их расположения.
    /// 
    /// \param y     y-координата ячейки
	///
	////////////////////////////////////////////////////////////
	utilites::MagicGameObjectsConcurrensUnorderedSet* const GetCellDynamicObjectsSet(const size_t y) const;

	////////////////////////////////////////////////////////////
	/// \brief Добавляет в ячейку статический объект.
	/// 
	/// \param y     y-координата ячейки.
	/// \param object     Указатель на добавляемый объект.
	///
	////////////////////////////////////////////////////////////
	bool AddStaticObject(const size_t y, MagicGameObject* object);

	////////////////////////////////////////////////////////////
	/// \brief Добавляет в ячейку подвижный объект.
	/// 
	/// \param y     y-координата ячейки.
	/// \param object     Указатель на добавляемый объект.
	///
	////////////////////////////////////////////////////////////
	bool AddDynamicObject(const size_t y, MagicGameObject* object);
};

