#pragma once

#include "pch.h"

using namespace std;

enum class ObjectTypeFlags : uint16_t
{
	MustBeRendered = 1 << 0,
	VisibilityBlocking = 1 << 1,
	PhysicCollision = 1 << 2,
	Trigger = 1 << 3
};

////////////////////////////////////////////////////////////
/// \brief Игровой объект.
///
/// Самый базовый вариант объекта.
/// Надо будет прикрутить к нему возможность анимации,
/// но для начала и так сойдет.
/// 
/// \param Параметр     Заполнить параметры.
///
////////////////////////////////////////////////////////////
class MagicGameObject : public sf::Drawable
{
public:

	

private:
	////////////////////////////////////////////////////////////
	/// \brief Прямоугольник объекта.
	///
	/// Левый верхний угол - положение в пространстве.
	/// Ширина и высота - размеры.
	/// 
	/// \param Параметр     Заполнить параметры.
	///
	////////////////////////////////////////////////////////////
	sf::FloatRect objectRect;

	unique_ptr<sf::Vector2f> topLeft;
	unique_ptr<sf::Vector2f> topRight;
	unique_ptr<sf::Vector2f> bottomLeft;
	unique_ptr<sf::Vector2f> bottomRight;
	uint16_t flags;
	int zOrder;

	////////////////////////////////////////////////////////////
	/// \brief Массив вершин для отрисовки.
	///
	/// 
	/// 
	/// 
	/// 
	///
	////////////////////////////////////////////////////////////
	sf::VertexArray m_vertices;

	////////////////////////////////////////////////////////////
	/// \brief Указатель на текстуру.
	///
	/// 
	/// 
	/// 
	/// 
	///
	////////////////////////////////////////////////////////////
	sf::Texture* m_texture;

	////////////////////////////////////////////////////////////
	/// \brief Отрисовка.
	///
	/// 
	/// 
	/// 
	/// \param target     Куда рисовать.
	/// \param states     Параметры рисования.
	///
	////////////////////////////////////////////////////////////
	virtual void draw(sf::RenderTarget& target, sf::RenderStates states) const;
	

public:

	

	////////////////////////////////////////////////////////////
	/// \brief Тиканье.
	///
	/// Определяет, будет ли отрабатываться содержимое функции Tick
	/// 
	/// 
	/// 
	///
	////////////////////////////////////////////////////////////
	bool ticking;

	////////////////////////////////////////////////////////////
	/// \brief Конструктор объекта.
	///
	/// Пока принимает только прямоугольник.
	/// 
	/// 
	/// \param _objectRect     Прямоугольник объекта (положение и размер).
	///
	////////////////////////////////////////////////////////////
	MagicGameObject(const sf::FloatRect _objectRect);

	////////////////////////////////////////////////////////////
	/// \brief Получить прямоугольник объекта.
	///
	/// 
	/// 
	/// 
	/// 
	///
	////////////////////////////////////////////////////////////
	sf::FloatRect GetRect() const;

	////////////////////////////////////////////////////////////
	/// \brief Установить положение объекта.
	///
	/// Устанавливается положение верхнего левого угла прямоугольника,
	/// а также смещаются вершины.
	/// 
	/// \param newPosition     Новое положение.
	///
	////////////////////////////////////////////////////////////
	void SetPosition(sf::Vector2f newPosition);

	////////////////////////////////////////////////////////////
	/// \brief Тиканье.
	///
	/// Функция, обрабатывающая "взаимоотношение" объекта со временем:
	/// анимация, таймеры и т.д.
	/// 
	/// \param deltaTime     Количество прошедшего времени.
	///
	////////////////////////////////////////////////////////////
	void Tick(float deltaTime);

	void GetCornersPointers(vector<sf::Vector2f*>* const ret_vector);
	uint16_t GetFlags();
};

